## Reading and Writing Text files

In [ ]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
import os
os.getcwd()

'C:\\Users\\Soumadiptya'

In [6]:
os.chdir("H:/Career Development/Python Learning/Datasets")

In [7]:
os.listdir() # Lists files in the directory

['dummydata1.csv']

In [8]:
dframe = pd.read_csv('dummydata1.csv')

In [9]:
dframe

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  5  d  f  rabbit
2  5  2  5  7     dog

In [10]:
dframe = pd.read_csv('dummydata1.csv', header=None)
# Strangely the None argument is not in quotes

In [11]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  5  d  f  rabbit
3  5  2  5  7     dog

In [13]:
dframe.columns()

TypeError: 'Int64Index' object is not callable

In [15]:
dframe2 = pd.read_table('dummydata11.csv', sep = '|')
dframe2

  Col1 Col2 Col3 Col4    Col5
0    q    r    s    t   apple
1    2    3    4    5    pear
2    a    5    d    f  rabbit
3    5    2    5    7     dog

In [16]:
# To read specified no. of rows
pd.read_csv('dummydata1.csv', header = None, nrows = 2)

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [17]:
# Writing files
dframe.to_csv("test.csv")

In [19]:
dframe2.to_csv("test2.txt", sep = "|")

## Write only specific columns

In [20]:
dframe2.to_csv("test3.txt", sep = "|", columns = ['Col1','Col2'])

In [21]:
os.listdir()

['dummydata1.csv',
 'dummydata11.csv',
 'test.csv',
 'test2.txt',
 'test3.txt',
 'toothpaste.csv']

In [23]:
toothpaste = pd.read_csv('toothpaste.csv')
toothpaste

   Study    nA  meanA   sdA    nB  meanB   sdB
0      1   134   5.96  4.24   113   4.72  4.72
1      2   175   4.74  4.64   151   5.07  5.38
2      3   137   2.04  2.59   140   2.51  3.22
3      4   184   2.70  2.32   179   3.20  2.46
4      5   174   6.09  4.86   169   5.81  5.14
5      6   754   4.72  5.33   736   4.76  5.29
6      7   209  10.10  8.10   209  10.90  7.90
7      8  1151   2.82  3.05  1122   3.01  3.32
8      9   679   3.88  4.85   673   4.37  5.37

In [24]:
# To view dimensions of the datasets
toothpaste.shape # 9 rows 7 columns

(9, 7)

In [25]:
toothpaste.columns

Index(['Study', 'nA', 'meanA', 'sdA', 'nB', 'meanB', 'sdB'], dtype='object')

In [27]:
toothpaste.describe() # Basically summary from R

,Study,nA,meanA,sdA,nB,meanB,sdB
count,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000
mean,5.000000,399.666667,4.783333,4.442222,388.000000,4.927778,4.755556
std,2.738613,369.445530,2.446978,1.748612,363.673274,2.483877,1.611599
min,1.000000,134.000000,2.040000,2.320000,113.000000,2.510000,2.460000
25%,3.000000,174.000000,2.820000,3.050000,151.000000,3.200000,3.320000
50%,5.000000,184.000000,4.720000,4.640000,179.000000,4.720000,5.140000
75%,7.000000,679.000000,5.960000,4.860000,673.000000,5.070000,5.370000
max,9.000000,1151.000000,10.100000,8.100000,1122.000000,10.900000,7.900000

In [29]:
toothpaste.info() # Gives the structure of the data. Also memory usage etc

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
Study    9 non-null int64
nA       9 non-null int64
meanA    9 non-null float64
sdA      9 non-null float64
nB       9 non-null int64
meanB    9 non-null float64
sdB      9 non-null float64
dtypes: float64(4), int64(3)
memory usage: 584.0 bytes

In [31]:
toothpaste.meanA.value_counts() # No. of unique values and occurences of each. Basically table() from R

3.88     1
4.72     1
10.10    1
6.09     1
4.74     1
2.70     1
2.04     1
5.96     1
2.82     1
Name: meanA, dtype: int64

In [32]:
toothpaste.meanA.describe() # Describe one column instead of entire dataset

count     9.000000
mean      4.783333
std       2.446978
min       2.040000
25%       2.820000
50%       4.720000
75%       5.960000
max      10.100000
Name: meanA, dtype: float64

In [33]:
toothpaste.isna()

   Study     nA  meanA    sdA     nB  meanB    sdB
0  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False
4  False  False  False  False  False  False  False
5  False  False  False  False  False  False  False
6  False  False  False  False  False  False  False
7  False  False  False  False  False  False  False
8  False  False  False  False  False  False  False